{
    "Unknown": "Happy Lunar New Year! Welcome to the majestic Year of the Dragon, a time ripe with energy, transformation, and prosperity for everyone. The Dragon, a beacon of strength and good fortune, marks this year as one for achieving great things and personal growth. It's an invitation to embrace the Dragon's bold spirit, pushing you to pursue your dreams with determination. This is the year to welcome change, aim high, and leverage the Dragon's supportive luck for new starts and successful ventures. Relationships will bloom, fueled by the Dragon's charismatic influence, enhancing connections and understanding. It's a season for strengthening bonds and welcoming new ones, as a vibrant social scene adds joy to our lives. Financially, the Dragon's presence hints at a growth-filled period, where smart investments and new initiatives can flourish. In terms of health, the Dragon's energy encourages us to embrace balance and vitality. Let the Dragon inspire you to reach new heights, face challenges boldly, and craft a year filled with achievement and joy.",
    "Rat": "Happy Lunar New Year! Welcome to the Year of the Dragon, a time of promise for the astute Rat. This year, your natural shrewdness, charm, and resourcefulness will shine, steered by the Dragon's vibrant energy. Your ambitions will soar, driven by passion and a determination that turns challenges into opportunities. Adaptability will be your key to opening new doors and navigating through the year's changes with elegance. Your ability to care for and manage relationships will make personal and professional connections thrive. Financially, your savvy and cautious approach promises fruitful outcomes. Remember, balance and moderation are essential to maintaining your vitality and supporting your ambitious plans. Embrace the year with Rat wisdom and agility. Here's to a year filled with growth, deep connections, and prosperity. Happy Lunar New Year!",
    "Ox": "Happy Lunar New Year! The Year of the Dragon brings a wave of strength and resilience to the dependable Ox. This year, your virtues of diligence, reliability, and perseverance merge with the Dragon's lively energy, promising significant growth and progress. Your steadfast work ethic and the Dragon's transformative power will make your efforts fruitful in surprising ways. Professionally, your unwavering dedication will be recognized, unlocking new possibilities and advancements. Your sincere approach will also enrich personal relationships, building strong and supportive bonds. Financially, your wisdom will lead to secure and potentially profitable decisions. With your robust health and disciplined lifestyle, you're set to face the year's challenges and seize its opportunities with vigor. Embrace the Year of the Dragon as a showcase of your strength and resolve. Here's to a year of remarkable achievements. Happy Lunar New Year!",
    "Tiger": "Happy Lunar New Year! The Year of the Dragon energizes the bold Tiger, heralding a time of courage and action. This year, your Tiger essence of bravery, competitiveness, and spontaneity aligns with the Dragon's lively spirit, setting the stage for a year filled with daring pursuits and notable achievements. Your fearless nature, amplified by the Dragon's luck, encourages you to take bold steps and embrace new starts. Professionally, your creativity and leadership will lead to significant breakthroughs, while your passion strengthens your personal connections, fostering deep and meaningful relationships. Financially, trust your instincts for smart, long-term investments. An active lifestyle and mindfulness will keep your energy and focus sharp, ensuring you're ready for the year's challenges and opportunities. Let the fiery energy of the Dragon fuel your Tiger spirit, transforming ambitions into realities. Here's to a year of adventure and success. Happy Lunar New Year!",
    "Dragon": "Happy Lunar New Year! Welcome to the Year of the Dragon – year that mirrors your own zodiac sign. This year, let the Dragon's spirit fuel your passions and guide you to success. Your courage, intelligence, and resilience are your greatest assets, empowering you to navigate challenges with ease. The wisdom of the Dragon enhances your decision-making, bringing clarity to your path. Embrace the adventurous spirit of the Dragon. Dive into new ventures in work, personal development, or relationships. Your leadership will attract opportunities and allies. But remember, balance is key. Pair ambition with patience and cherish connections with loved ones. As the Dragon soars, remember: the only limits are those you set for yourself. Here's to a year of surpassing those limits, achieving greatness, and creating your own legend. May the Year of the Dragon bring you prosperity, happiness, and thrilling adventures.",
    "Rabbit": "Happy Lunar New Year! Welcome to the Year of the Dragon, a promising time for those with the gentle Rabbit spirit! This year promises a blend of creativity, prosperity, and harmony. Your Rabbit traits of compassion, sensitivity, and caution will merge with the Dragon's charisma, creating a year of balanced growth and flourishing dreams. Expect a time of enrichment where your diplomacy shines in professional settings, attracting success through teamwork. In personal life, your nurturing nature will strengthen bonds, enhancing joy and respect in relationships. Financial stability and growth await, thanks to your prudent decisions and the Dragon's creative push. Trust your instincts—they may lead to rewarding ventures or artistic expressions. Focus on peace and well-being to stay resilient and open to new opportunities. Embrace this year with Rabbit grace and Dragon confidence. May your creativity and kindness lead to a serene and prosperous year. Happy Lunar New Year!",
    "Snake": "Happy Lunar New Year! The Year of the Dragon ushers in a transformative period for those with the intuitive Snake spirit. This year is set to amplify your Snake qualities of intelligence, sophistication, and intuition, synergizing with the Dragon's vitality for significant personal and professional breakthroughs. Strategic thinking and analytical prowess will be your assets, opening doors to professional recognition and growth. Your charisma will enrich personal connections, attracting admiration for your insightful nature. Financially, the year leans towards rewarding calculated risks, with your prudence and the Dragon's luck guiding you to prosperous investments. To stay energized and balanced, focus on regular exercise and mental relaxation, navigating the year's vibrancy without stress. Step into the Year of the Dragon with Snake wisdom and grace. Let insight transform challenges into opportunities for success. Happy Lunar New Year!",
    "Horse": "Happy Lunar New Year! The Year of the Dragon ushers in a period of energy and liberation for those with the vibrant Horse spirit. This year promises to amplify your enthusiasm, independence, and vitality, merging with the Dragon's dynamism for a journey filled with possibilities and adventures. Expect a year of exhilarating progress: in your career, your dedication will be rewarded with recognition and new paths, while your social life blooms, fueled by your charismatic and open-hearted nature. Financially, your adventurous streak could uncover thrilling opportunities, with the Dragon's influence nudging you towards rewarding risks. Stay active and embrace the outdoors to maintain your well-being and harness this year's vibrant energy. Let the Year of the Dragon be your playground! Chase your dreams with courage and embrace the adventures that await. Happy Lunar New Year!",
    "Goat": "Happy Lunar New Year! The Year of the Dragon heralds a time of serenity and prosperity for the creative Goat. This year, your creativity, thoughtfulness, and resilience are set to flourish, powered by the Dragon's prosperous energy. Expect a canvas of opportunities for artistic expression and emotional growth. Professionally, you're poised for fulfilling ventures that spotlight your talents and offer recognition. Personally, your empathetic nature will foster deeper connections, promoting harmony and understanding. Financially, adopt a balanced approach, as your sensibility steers you towards wise investments. The Dragon's fortune may also surprise you with gains from creative projects. Prioritize a calm lifestyle to fuel your passions and remain grounded. Step into the Year of the Dragon embracing your Goat's artistic spirit and gentle strength. May your imagination and kindness lead you to a year rich in creativity and connections. Happy Lunar New Year!",
    "Monkey": "Happy Lunar New Year! The Year of the Dragon ignites a period of innovation and adventure for the ingenious Monkey. Your intelligence, adaptability, and curiosity are supercharged by the Dragon's lively spirit, promising a year of growth and exploration. Expect your cleverness and the Dragon's audacity to lead to remarkable achievements in both personal and professional realms. Your career is on the brink of an exciting climb, thanks to your innovative thinking and eagerness for challenges. Socially, your wit and charm will draw fascinating friends, enriching your life with valuable interactions. Financially, it's a time to follow your inventive instincts, with unexpected opportunities offering financial benefits. Stay physically and mentally agile to keep pace with this dynamic year. Embrace the Year of the Dragon's playground. Let your intelligence and energy guide you through adventures and discoveries. Happy Lunar New Year!",
    "Rooster": "Happy Lunar New Year! The dawn of the Year of the Dragon brings a rejuvenating and ambitious time for the vigilant Rooster. Your confidence, diligence, and precision will align with the Dragon's vibrant essence, setting you up for a year of significant achievements and growth. The combination of the Rooster's meticulousness and the Dragon's zest suggests success driven by your dedication and attention to detail. Professionally, expect recognition and opportunities for progress. In personal relationships, your straightforwardness will foster honesty and respect. Financially, the year calls for a disciplined yet innovative approach, with the Dragon's luck potentially leading to profitable ventures. Balancing an active lifestyle with rest is crucial for maintaining the energy needed for your ambitions. Step into the Year of the Dragon with the Rooster's boldness and integrity. Let dedication and vision lead you to a promising and successful year. Happy Lunar New Year!",
    "Pig": "Happy Lunar New Year! The Year of the Dragon ushers in a period of abundance and joy for the kind-hearted Pig. This year, your kindness, generosity, and love for life will be amplified by the Dragon's vibrant and fortunate energies, promising a year rich with happiness and opportunities. Your warmth and sincerity will make your social and emotional life bloom. Surrounded by support, it’s a perfect time to strengthen relationships and forge new ones. At work, your optimism and diligence will shine, leading to recognition and opportunities for growth. Financially, a balanced approach will bring growth, with your wisdom guiding you through choices. Health-wise, a balanced lifestyle and finding joy in the simple things will keep you energized and strong. Step into the Year of the Dragon with the Pig's open heart and zest for life. May this year be a celebration of friendship, love, and success. Happy Lunar New Year!"
}
